01- How to find version

In [19]:
import pandas as pd
pd.__version__

'1.3.4'

Another way

In [20]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 945c9ed766a61c7d2c0a7cbb251b6edebf9cb7d5
python           : 3.9.7.final.0
python-bits      : 32
OS               : Windows
OS-release       : 10
Version          : 10.0.19044
machine          : x86
processor        : x86 Family 6 Model 42 Stepping 7, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.3.4
numpy            : 1.20.3
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 21.2.4
setuptools       : 58.0.4
Cython           : 0.29.24
pytest           : 6.2.4
hypothesis       : None
sphinx           : 4.2.0
blosc            : None
feather          : None
xlsxwriter       : 3.0.1
lxml.etree       : 4.6.3
html5lib         : 1.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.3
IPython          : 7.29.0
pandas_datareader: None
bs4              : 4.10.0
bottleneck       : 1.3.2
fsspec           : 2021.10.1
fastparquet      : None
gcsfs            : None
matplotlib       : 3.4.3
numexpr          : 2.7.3
odfpy            : None
openpyxl         : 3.0.9
pandas_gbq       : None
pyarrow          : None
pyxlsb           : None
s3fs             : None
scipy            : 1.6.2
sqlalchemy       : 1.4.22
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 2.0.1
xlwt             : 1.3.0
numba            : 0.54.1

02- make a dataframe

In [21]:
df=pd.DataFrame({"A col": [1,2,3,22,24,32], "B col": [4,5,6,56,85,65]})
df.head

<bound method NDFrame.head of    A col  B col
0      1      4
1      2      5
2      3      6
3     22     56
4     24     85
5     32     65>

Numpy array use to create dataframe

In [22]:
import numpy as np
arr=np.array([[1,2,3,], [4,5,6,], [7,8,9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

numpay array dataframe another way

In [24]:
df1=pd.DataFrame(np.random.rand(4,8),columns=list("ABCDEFGH"))

#- how to rename colums?

In [25]:
df

   A col  B col
0      1      4
1      2      5
2      3      6
3     22     56
4     24     85
5     32     65

In [27]:
df.rename(columns={'A col': 'col a','B col': 'col b'})

   col a  col b
0      1      4
1      2      5
2      3      6
3     22     56
4     24     85
5     32     65

In [31]:
df.columns=['col_aa', 'col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3      22      56
4      24      85
5      32      65

 replace any character ,string

In [32]:
df.columns=df.columns.str.replace(' ','_')
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3      22      56
4      24      85
5      32      65

Adding prefix to colums

In [33]:
df=df.add_prefix('baba_')
df

   baba_col_aa  baba_col_bb
0            1            4
1            2            5
2            3            6
3           22           56
4           24           85
5           32           65

Adding suffix to colums

In [34]:
df=df.add_suffix('_baba')
df

   baba_col_aa_baba  baba_col_bb_baba
0                 1                 4
1                 2                 5
2                 3                 6
3                22                56
4                24                85
5                32                65

In [36]:
df.columns=['col a', 'col b']
df

   col a  col b
0      1      4
1      2      5
2      3      6
3     22     56
4     24     85
5     32     65

4-using template data

In [41]:
import pandas as pd
import  numpy as np
import seaborn as sns
df3=sns.load_dataset('tips')
df3.head

<bound method NDFrame.head of      total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]>

SUMMARY

In [40]:
df3.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

how to see the colums names

In [44]:
df3.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

saving a data set

In [47]:
df3.to_csv('tip_save.csv')
df3.to_excel('tips_save.xlsx')

5- using your own data

In [48]:
import pandas as pd
df= pd.read_excel('tips_save.xlsx')
df

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

6- Reverse row order

In [49]:
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>